; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	infrared5 - mode
	spectrograph1 - mode
	spectrograph2 - mode
	infrared3 - mode
	spectrograph0 - mode
	thermograph4 - mode
	GroundStation3 - direction
	Star6 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	GroundStation11 - direction
	GroundStation0 - direction
	Star1 - direction
	GroundStation4 - direction
	Star8 - direction
	Star7 - direction
	GroundStation2 - direction
	Star5 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph2)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 thermograph4)
	(supports instrument3 infrared5)
	(calibration_target instrument3 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star13)
	(supports instrument4 infrared3)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star7)
	(supports instrument5 infrared5)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 Star8)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star5)
	(supports instrument7 spectrograph0)
	(supports instrument7 infrared5)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 Star5)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(on_board instrument7 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet12)
)
(:goal (and
	(pointing satellite1 Phenomenon15)
	(have_image Planet12 spectrograph1)
	(have_image Planet12 infrared3)
	(have_image Star13 spectrograph2)
	(have_image Star13 infrared3)
	(have_image Phenomenon14 spectrograph1)
	(have_image Phenomenon14 spectrograph2)
	(have_image Phenomenon15 spectrograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
2. (turn_to satellite1 phenomenon15 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 phenomenon15)
   goals met: 1 of 8
3. (turn_to satellite0 groundstation0 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 8
4. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 1 of 8
5. (turn_to satellite0 phenomenon14 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 8
6. (take_image satellite0 phenomenon14 instrument0 spectrograph1)
   added: (have_image phenomenon14 spectrograph1)
   goals met: 2 of 8
7. (take_image satellite0 phenomenon14 instrument0 spectrograph2)
   added: (have_image phenomenon14 spectrograph2)
   goals met: 3 of 8
8. (turn_to satellite0 phenomenon15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon15)
   goals met: 3 of 8
9. (take_image satellite0 phenomenon15 instrument0 spectrograph1)
   added: (have_image phenomenon15 spectrograph1)
   goals met: 4 of 8
10. (turn_to satellite0 planet12 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet12)
   goals met: 4 of 8
11. (take_image satellite0 planet12 instrument0 infrared3)
   added: (have_image planet12 infrared3)
   goals met: 5 of 8
12. (take_image satellite0 planet12 instrument0 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 6 of 8
13. (turn_to satellite0 star13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star13)
   goals met: 6 of 8
14. (take_image satellite0 star13 instrument0 infrared3)
   added: (have_image star13 infrared3)
   goals met: 7 of 8
15. (take_image satellite0 star13 instrument0 spectrograph2)
   added: (have_image star13 spectrograph2)
   goals met: 8 of 8
